[{"image":"https://webtoon-phinf.pstatic.net/20220827_174/1661543735069ucwJI_JPEG/1Marry+My+Husband_Launch_thumbnail_desktop.jpg?type=a210","title":"Marry My HusbandMarry My Husband","author":"sungsojak / LICO","likes":"7.6M","genre":"Romance","shortSummary":"","longSummary":"When Jiwon, a 37-year-old cancer patient, walks in on her husband and best friend, she realizes her whole life has been a lie. What’s worse, she dies a tragic death at the hands of her husband. Would things have been different if she had made different choices? Fortunately for Jiwon, she is given the chance to rewrite her fate when she is reincarnated as her younger self. This time, she vows to live a happy life. But first comes revenge. Her plan? To marry off her now former best friend to her lying, cheating husband."},{"image":"https://webtoon-phinf.pstatic.net/20211201_245/1638300900966DY3LN_JPEG/0Morgana26Oz_Launch_desktop_thumbnail.jpg?type=a210","title":"Morgana and OzMorgana and Oz","author":"Miyuli","likes":"5.6M","genre":"Fantasy","shortSummary":"","longSummary":"What happens when a struggling witch meets an angsty vampire? Either love or war. Morgana belongs to a long line of witches, and Oz to the rival vampire clan. After a chance encounter… and maybe a few stray spells… these two need to find a way to work together, or risk all-out war between coven and clan."},{"image":"https://webtoon-phinf.pstatic.net/20221111_116/1668106319110SEwFW_JPEG/7ImtheQueeninThisLife_thumbnail_desktop.jpg?type=a210","title":"I’m the Queen in This LifeI’m the Queen in This Life","author":"Themis / Omin","likes":"3.5M","genre":"Fantasy","shortSummary":"","longSummary":"The Etruscan Kingdom is stained with blood when the king’s illegitimate son Cesare conspires with his fiancée Ariadne to usurp the throne from his half-brother Alfonso. Despite Ariadne’s devotion to the new king, her faith is shattered when she is betrayed by him and eventually murdered by her own sister, who wishes to be queen. To her surprise, Ariadne finds herself sent back in time to her 17-year-old self. As she navigates the perils and opportunities of palace intrigue, Ariadne must make the most of her guile and grit to ensure that her tragic future does not repeat itself."},{"image":"https://webtoon-phinf.pstatic.net/20181022_300/1540173096133NHuNf_JPEG/10_EC8DB8EB84A4EC9DBC_ipad.jpg?type=a210","title":"SubZeroSubZero","author":"Junepurrr","likes":"25M","genre":"Romance","shortSummary":"","longSummary":"What would you sacrifice to save your family?  How far would you go to protect your people? For Clove, the last princess of a near-extinct Dragon clan, the answer is the unthinkable:  MARRY your greatest sworn enemy in an effort to bring peace to your land."},{"image":"https://webtoon-phinf.pstatic.net/20230821_152/1692555581064fUiAv_JPEG/5SeriesName_Thumbnail_Desktop.jpg?type=a210","title":"To The Stars and BackTo The Stars and Back","author":"Peglo","likes":"6.8M","genre":"Slice of life","shortSummary":"","longSummary":"Introverted and grumpy, 20-year-old Kang Dae spends the majority of his time alone, and he prefers it this way. One day, he gets a very friendly and bubbly neighbor named Bo Seon. Suddenly, his life takes a very different turn."},{"image":"https://webtoon-phinf.pstatic.net/20210714_210/1626210894684e0Nay_JPEG/8Tricked+into+Becoming+the+Heroine27s+StepmotherLaunch_desktop_thumbnail.jpg?type=a210","title":"Tricked into Becoming the Heroine's StepmotherTricked into Becoming the Heroine's Stepmother","author":"HARIHEEN / MOKGAMGI","likes":"6.7M","genre":"Fantasy","shortSummary":"","longSummary":"After her death, Daisy Heidi is reincarnated into the world of “Why Did the Duke’s Daughter Roll Across the Pumpkin Patch?”, a so-called “tragedy” novel where the beautiful heroine Pierta indulges in reckless lust and hedonism with ten ardent suitors to a bitter end. Though Daisy is reborn as a poor commoner in this world, she has one distinct advantage over others in her second chance at life -- she’s the author of the original novel! When fate brings Daisy into the lives of the novel’s heroine Pierta and her dashing father Duke Henstone, Daisy vows to do everything she can to prevent Pierta’s future of despair."},{"image":"https://webtoon-phinf.pstatic.net/20230324_9/167961213201856COO_JPEG/7TowerOfGod_thumbnail_desktop.jpg?type=a210","title":"Tower of GodTower of God","author":"SIU","likes":"57.2M","genre":"Fantasy","shortSummary":"","longSummary":"What do you desire? Money and wealth? Honor and pride? Authority and power? Revenge? Or something that transcends them all? Whatever you desire—it's here. "},{"image":"https://webtoon-phinf.pstatic.net/20210329_191/1617004364171zd189_JPEG/0Your-Smile-is-a-Trap_ipad.jpg?type=a210","title":"Your Smile is a TrapYour Smile is a Trap","author":"AENGO","likes":"8.5M","genre":"Romance","shortSummary":"","longSummary":"Ex-idol trainee Kiyu has lived his whole life adored by everyone for his good looks. But he dreams of ordinary high school life, so when he puts on glasses to blend in with his peers, he finds that making friends is a lot harder when you don’t have your looks to fall back on. Not to mention he’s also socially awkward, his new seatmate has a permanent scowl on her face, and his fans have tracked him down at his new school."},{"image":"https://webtoon-phinf.pstatic.net/20170306_197/14887668598417jPti_JPEG/Bigcard_PC.jpg?type=q90","title":"My Giant Nerd BoyfriendMy Giant Nerd Boyfriend","author":"fishball","likes":"67.4M","genre":"Slice of life","shortSummary":"Having a boyfriend who's a full foot taller than you might seem adorable at first, but it usually just ends up causing a whole bunch of minor inconveniences. Follow Fishball as she navigates the Malaysian life with her 6'5\" geeky boyfriend.","longSummary":"Having a boyfriend who's a full foot taller than you might seem adorable at first, but it usually just ends up causing a whole bunch of minor inconveniences. Follow Fishball as she navigates the Malaysian life with her 6'5\" geeky boyfriend."},{"image":"https://webtoon-phinf.pstatic.net/20210329_28/161699507467698wYD_JPEG/5Down-To-Earth_ipad.jpg?type=a210","title":"Down To EarthDown To Earth","author":"Pookie Senpai","likes":"20.4M","genre":"Romance","shortSummary":"","longSummary":"Kade lives his average life alone and undisturbed... until a cute alien girl crashes into his backyard! By opening up his home, will this other worldly girl inadvertently open up his heart?"},{"image":"https://webtoon-phinf.pstatic.net/20210414_292/16183417313068BDPj_JPEG/6Boyfriends._desktop_thumbnail.jpg?type=a210","title":"Boyfriends.Boyfriends.","author":"refrainbow","likes":"23M","genre":"Slice of life","shortSummary":"","longSummary":"A comic about getting yourself a boyfriend... or multiple boyfriends! Four college students begin a polyamorous relationship and navigate the adventure that is their dating life!"},{"image":"https://webtoon-phinf.pstatic.net/20230822_203/1692659369910KVdWz_JPEG/3Chasing_Red_thumbnail_desktop.jpg?type=a210","title":"Chasing RedChasing Red","author":"SilentMaru / Isabelle Ronin","likes":"181,799","genre":"Romance","shortSummary":"","longSummary":"College heartthrob Caleb Lockhart is the last person a girl like Veronica Strafford should be involved with. Ambitious and fiercely independent, Veronica refuses to be the campus player's next conquest, even after a chance encounter sparks an undeniable attraction between them. But after she’s evicted with nowhere else to go, Veronica finds herself leaning on someone else for the first time. Caleb has never wanted someone like this before and he's determined to pursue her, even as the secrets of their pasts threaten to break them apart."},{"image":"https://webtoon-phinf.pstatic.net/20230321_197/1679334187864xAk6R_JPEG/2TTWtBG_thumbnail_desktop.jpg?type=a210","title":"The Tyrant Wants to Be GoodThe Tyrant Wants to Be Good","author":"Ramguel / KAKON","likes":"1.7M","genre":"Fantasy","shortSummary":"","longSummary":"Nothing was ever handed to Dorothea Millanaire. No attention, no love, no power. So she decided to take them for herself… with her sword!\nShe accepts her fate when she is executed for being a bloodthirsty tyrant, only to wake up... as a child?! \nThis is her second chance. \nShe must not repeat history. \nShe must be good.  "},{"image":"https://webtoon-phinf.pstatic.net/20210608_130/1623106180981LmsJX_JPEG/4Homesick_desktop_thumbnail.jpg?type=a210","title":"HomesickHomesick","author":"Ms. Freaky","likes":"6.7M","genre":"Thriller","shortSummary":"","longSummary":"Rayne woke up with no memories of the apocalypse. Samael is just... a delinquent, who happened to find Rayne at a rooftop. They both ended up making a deal in order to survive in a world where cannibalistic monsters roam."},{"image":"https://webtoon-phinf.pstatic.net/20210410_293/1618006832031e19lx_JPEG/010_EC8DB8EB84A4EC9DBC_ipad.jpg?type=a210","title":"EleceedEleceed","author":"Jeho Son / ZHENA","likes":"24.5M","genre":"Action","shortSummary":"","longSummary":"Jiwoo is a kind-hearted young man who harnesses the lightning quick reflexes of a cat to secretly make the world a better place – one saved little child or foster pet at a time. Kayden is a secret agent on the run, who finds himself stuck in the body of a…um…decidedly fat old fluffy cat.  Together, armed with Jiwoo’s super powers and Kayden’s uber-smarts, they’re out to fight those forces who would let evil rule this world.  That is, if they can stand each other long enough to get the job done."},{"image":"https://webtoon-phinf.pstatic.net/20210612_193/1623447547542FJ7nc_JPEG/1VillaintoKillLaunch_desktop_thumbnail.jpg?type=a210","title":"Villain to KillVillain to Kill","author":"Fupin / Eunji","likes":"5.9M","genre":"Action","shortSummary":"","longSummary":"There are two kinds of people with special abilities: villains, who are driven by their evil desires, and psykers, who pursue justice and work against villains. Cassian Lee is a very powerful psyker with a good heart. But one day, when he visits his friend in Greece, things take a wrong turn. Following an unexpected chain of events, Cassian ends up in the body of a Korean high school boy... who has just become a villain! Will his sense of justice win in the end or will he end up becoming a cold-blooded villain?\n"},{"image":"https://webtoon-phinf.pstatic.net/20230403_251/16805029507250nHq1_JPEG/6MuseOnFame_thumbnail_desktop.jpg?type=a210","title":"Muse on FameMuse on Fame","author":"SOOJIN","likes":"1.2M","genre":"Drama","shortSummary":"","longSummary":"“I’m an unknown actress who cleans houses as a side gig. Ironically, my name means fame.” Struggling actress Myeong stumbles upon a photo exhibition filled with photos of her younger self, when she was filled with hope. Can she become a star as this mysterious photographer’s muse?"},{"image":"https://webtoon-phinf.pstatic.net/20230429_87/1682696381619vFQBg_JPEG/4MyHusbandChangesEveryNight_promobanner_desktop.jpg?type=q90","title":"My Husband Changes Every NightMy Husband Changes Every Night","author":"Yeoseulki / koo seul","likes":"846,315","genre":"Fantasy","shortSummary":"Following the death of the World Tree, all that stands between the apocalypse and salvation is the Divine Maiden, prophesied to restore peace and prosperity. But never mind all that. Princess Teriella Rufeon has more pressing issues at hand: her family keeps trying to kill her, she’s got a secret healing power to keep under wraps, and she’s just found out she’s being sent off to marry the infamous tyrant Emperor Rivanfel von Leonharta! But there’s more to Rivanfel than meets the eye, and Teriella discovers she isn’t the only one with a grave secret to hide…","longSummary":"Following the death of the World Tree, all that stands between the apocalypse and salvation is the Divine Maiden, prophesied to restore peace and prosperity. But never mind all that. Princess Teriella Rufeon has more pressing issues at hand: her family keeps trying to kill her, she’s got a secret healing power to keep under wraps, and she’s just found out she’s being sent off to marry the infamous tyrant Emperor Rivanfel von Leonharta! But there’s more to Rivanfel than meets the eye, and Teriella discovers she isn’t the only one with a grave secret to hide…"},{"image":"https://webtoon-phinf.pstatic.net/20230901_204/1693525639779WwItC_JPEG/6TheDragonKingsBride_Thumbnail_Desktop.jpg?type=a210","title":"The Dragon King’s BrideThe Dragon King’s Bride","author":"SOY MEDIA / Kanghee Jamae","likes":"809,391","genre":"Romance","shortSummary":"","longSummary":"Ten years ago, a young girl saved the life of a dragon. Little did they know that they would be brought together again by the vicissitudes of fate, when Lucina’s family estate is invaded by the fearsome Tayar nation led by King Hakan. After Lucina’s selfish stepmother offers her up as a bride to Hakan in exchange for their lives, Lucina realizes that she is now fated to journey to the arid kingdom of Tayar and marry its seemingly brutish king. Will fate lead the unlikely pair to ruin or romance? \n\n"},{"image":"https://webtoon-phinf.pstatic.net/20230215_68/1676406944721ykbfR_JPEG/6HelloBaby_thumbnail_desktop.jpg?type=a210","title":"Hello BabyHello Baby","author":"Enjelicious","likes":"2.2M","genre":"Romance","shortSummary":"","longSummary":"Gwen, apprehensive and disheartened, spends a one-night affair with a playful stranger, Arthur. After nearly 2 years pass, Gwen and Arthur cross paths again - this time fighting over their child's custody. Is it possible to settle this battle amicably, or will Gwen find herself desolate once again?"},{"image":"https://webtoon-phinf.pstatic.net/20230524_172/1684868982378giGVW_JPEG/2OmniscientReader_thumbnail_desktop.jpg?type=a210","title":"Omniscient ReaderOmniscient Reader","author":"singNsong / UMI","likes":"24.4M","genre":"Action","shortSummary":"","longSummary":"Dokja was an average office worker whose sole interest was reading his favorite web novel 'Three Ways to Survive the Apocalypse.' But when the novel suddenly becomes reality, he is the only person who knows how the world will end. Armed with this realization, Dokja uses his understanding to change the course of the story, and the world, as he knows it."},{"image":"https://webtoon-phinf.pstatic.net/20210430_189/1619747366300Iwsx1_JPEG/8TeenageMercenary_desktop_thumbnail.jpg?type=a210","title":"Teenage MercenaryTeenage Mercenary","author":"YC / Rakyeon","likes":"10.8M","genre":"Action","shortSummary":"","longSummary":"At the age of eight, Ijin Yu lost his parents in a plane crash and became stranded in a foreign land, forced to become a child mercenary in order to stay alive. He returns home ten years later to be reunited with his family in Korea, where food and shelter are plenty and everything seems peaceful. But Ijin will soon learn that life as a teenager is a whole other feat of survival. With only one year of high school left, Ijin must master new tactics to maneuver his way around the schoolhouse battleground. Can he survive a year of high school? Or rather, will the school be able to survive him?"},{"image":"https://webtoon-phinf.pstatic.net/20220903_86/1662153584580EEKVI_JPEG/3Daybreak_thumbnail_desktop.jpg?type=a210","title":"DaybreakDaybreak","author":"Moosopp","likes":"6.8M","genre":"Slice of life","shortSummary":"","longSummary":"Marcus has a crush, and Cog is completely unprepared for the hijinks that follow. Hopefully in their efforts to grow closer, they can brighten each other's day."},{"image":"https://webtoon-phinf.pstatic.net/20230209_239/1675893047670M7glJ_JPEG/3GAR_thumbnail_desktop.jpg?type=a210","title":"Go Away RomeoGo Away Romeo","author":"Paintword","likes":"2.2M","genre":"Romance","shortSummary":"","longSummary":"Rosaline believed that she and Romeo were destined to be lovers, but an unexpected tragedy comes when he dies on the same day as her cousin, Juliet. Rosaline learns she has one last memory of Romeo— a son. However, Rosaline’s loving memory of Romeo is shattered when she learns of his betrayal. With no one left to love and protect but her son, the last thing she wants is for Romeo to return to Verona and take everything she holds dear."},{"image":"https://webtoon-phinf.pstatic.net/20221221_125/1671591100893o9kua_JPEG/8Marionetta_thumbnail_desktop.jpg?type=a210","title":"MarionettaMarionetta","author":"Míriam Bonastre Tur","likes":"1.8M","genre":"Fantasy","shortSummary":"","longSummary":"A mysterious circus. A missing friend. A dangerous deal.\n\nJulia Lazarrett is happy with her honest, predictable life. But when her best friend Kamille convinces her to visit a travelling circus, they both get more than for which they bargained. Thrust into a world full of secrets, magic, and death, Julia finds herself presented with the most horrific of deals in order to survive."},{"image":"https://webtoon-phinf.pstatic.net/20230830_53/1693351722212lU60V_JPEG/6Retired-Demon-King_Landing-Page_Promo-Banner_Desktop.jpg?type=q90","title":"Retired Demon KingRetired Demon King","author":"Cheezemate","likes":"79,239","genre":"Romance","shortSummary":"When the Demon King feels challenged by the hero to find love, he infiltrates the school for human adventurers where romance thrives the most, only to find that the school is under the holy church... which main purpose is to kill the Demon King.","longSummary":"When the Demon King feels challenged by the hero to find love, he infiltrates the school for human adventurers where romance thrives the most, only to find that the school is under the holy church... which main purpose is to kill the Demon King."},{"image":"https://webtoon-phinf.pstatic.net/20210709_198/1625772552257GtBWK_JPEG/8SchoolBusGraveyardLaunch_desktop_thumbnail.jpg?type=a210","title":"School Bus GraveyardSchool Bus Graveyard","author":"Red","likes":"4.2M","genre":"Thriller","shortSummary":"","longSummary":"Ashlyn is a loner in high school with no friends. But when a fateful visit to a haunted house causes her and her classmates to see monsters at night, she'll be forced to forge bonds to survive."},{"image":"https://webtoon-phinf.pstatic.net/20160523_19/1463972744893SJ3Oh_JPEG/bigcard_pc.jpg?type=q90","title":"unOrdinaryunOrdinary","author":"uru-chan","likes":"60.1M","genre":"Superhero","shortSummary":"Nobody paid much attention to John – just a normal teenager at a high school where the social elite happen to possess unthinkable powers and abilities. But John’s got a secret past that threatens to bring down the school’s whole social order – and much more. Fulfilling his destiny won’t be easy though, because there are battles, frenemies and deadly conspiracies around every corner.","longSummary":"Nobody paid much attention to John – just a normal teenager at a high school where the social elite happen to possess unthinkable powers and abilities. But John’s got a secret past that threatens to bring down the school’s whole social order – and much more. Fulfilling his destiny won’t be easy though, because there are battles, frenemies and deadly conspiracies around every corner."},{"image":"https://webtoon-phinf.pstatic.net/20211113_128/1636751666293pbDIK_JPEG/3Eaternal+Nocturnal_Launch_desktop_thumbnail.jpg?type=a210","title":"Eaternal NocturnalEaternal Nocturnal","author":"instantmiso","likes":"6.7M","genre":"Romance","shortSummary":"","longSummary":"The man of her dreams does exist… too bad she can’t fall asleep. When Eve is visited one night by a mysterious apparition, she finds that her chronic insomnia is miraculously cured. Meanwhile Dae, the dream eater, finds himself unexpectedly and unwillingly drawn to Eve. This can either be a dream come true or their worst nightmare."},{"image":"https://webtoon-phinf.pstatic.net/20230613_97/1686617777591rgyzF_JPEG/7ImTheVillain_thumbnail_desktop.jpg?type=a210","title":"I Am the VillainI Am the Villain","author":"Sejji","likes":"1M","genre":"Romance","shortSummary":"","longSummary":"Working hard is supposed to take you far - but into the world of your best friend's novel? \n\nFor Lucy, being whisked into a life of ballrooms and picnics isn't exactly what it's cracked up to be; at least, not when everyone has mistaken her for the villain flagged for death. To escape this fate, Lucy must transform from modern workaholic to high society schemer if she even has a chance at returning home. Will she make it? Or will this world of beautiful outfits, strawberry desserts, and dashingly handsome gentlemen seal her fate?"},{"image":"https://webtoon-phinf.pstatic.net/20210908_32/1631043278314jN45V_JPEG/3BatmanFamilyAdven_desktop_thumbnail.jpg?type=a210","title":"Batman: Wayne Family AdventuresBatman: Wayne Family Adventures","author":"StarBite / CRC Payne","likes":"8.5M","genre":"Slice of life","shortSummary":"","longSummary":"Batman needs a break. But with new vigilante Duke Thomas moving into Wayne Manor and an endless supply of adopted, fostered, and biological superhero children to manage, Bruce Wayne is going to have his hands full. Being a father can't be harder than being Batman, right?"},{"image":"https://webtoon-phinf.pstatic.net/20230821_152/1692555581064fUiAv_JPEG/5SeriesName_Thumbnail_Desktop.jpg?type=a210","title":"To The Stars and BackTo The Stars and Back","author":"Peglo","likes":"6.8M","genre":"Slice of life","shortSummary":"","longSummary":"Introverted and grumpy, 20-year-old Kang Dae spends the majority of his time alone, and he prefers it this way. One day, he gets a very friendly and bubbly neighbor named Bo Seon. Suddenly, his life takes a very different turn."},{"image":"https://webtoon-phinf.pstatic.net/20210329_258/1616995321324d5Ob4_JPEG/3Mage-26-Demon-Queen_ipad.jpg?type=a210","title":"Mage & Demon QueenMage & Demon Queen","author":"Color_LES","likes":"23.9M","genre":"Comedy","shortSummary":"","longSummary":"Adventurers seek to take the demon queen’s head, but a love-struck young female mage wishes to take her hand. Join us won’t you, for this bawdy tale of love and persistence set inside a real-life RPG."},{"image":"https://webtoon-phinf.pstatic.net/20230809_108/1691561623914yJOl3_JPEG/6LockedOntoYou_Thumbnail_Desktop.jpg?type=a210","title":"Locked Onto YouLocked Onto You","author":"Lee dala / Jeong Hyejin","likes":"317,058","genre":"Romance","shortSummary":"","longSummary":"Detective Ganghui encounters Hajun, a world-famous designer who looks exactly like her late boyfriend, Yujin. He even wears the matching ring Ganghui and Yujin had shared. Hajun seems to know what’s bothering her but won’t tell her the secret behind the uncanny resemblance. Instead, he keeps persuading her to date and later marry him. Now Ganghui has two options: follow her heart and fall in love with that man or follow her head to find out the truth about him. \nOh, wait. Maybe, just maybe… she’ll be able to choose both.\n"},{"image":"https://webtoon-phinf.pstatic.net/20230711_188/1689039199347axhFk_JPEG/8Series_thumbnail_desktop.jpg?type=a210","title":"Baby TyrantBaby Tyrant","author":"Lee Huin / Awon","likes":"497,757","genre":"Fantasy","shortSummary":"","longSummary":"Gyeoul Yoon is no stranger to tragedy, having lost everything -- even her life -- because of her good-for-nothing father. When she reawakens after death, Gyeoul finds herself in the body of a newborn baby -- she is now Princess Mabel of the powerful Ermaneau Empire! With her doting new family and the empire’s might at her disposal, Mabel has everything she’s ever wanted. Upon learning that she’s the subject of a prophecy with the world’s salvation at stake, Mabel quickly realizes that there are people who will stop at nothing to destroy her newfound peace."},{"image":"https://webtoon-phinf.pstatic.net/20230310_3/1678397413066QHyH1_JPEG/5IWastheFinalBoss_thumbnail_desktop.jpg?type=a210","title":"I Was the Final BossI Was the Final Boss","author":"LuckS","likes":"1.2M","genre":"Fantasy","shortSummary":"","longSummary":"Baphomet is the ruthless, dispassionate lord of the Abyssal Tower, a mysterious, monster-filled dungeon plaguing the human world. Many Hunters seek to defeat him and bring the tower down to no avail. Despite his demonic power, Baphomet grows curious about humanity. One day, Baphomet is defeated by Raven, the strongest Hunter, and realizes that his true wish is to be just like the humans he previously looked down on. In death, he is granted his wish, as he awakens as a human – without his powers!"},{"image":"https://webtoon-phinf.pstatic.net/20220707_252/1657130706672kzKRg_JPEG/1OperationTrueLove_thumbnail_desktop.jpg?type=a210","title":"Operation: True LoveOperation: True Love","author":"kkokkalee / Dledumb","likes":"9.7M","genre":"Romance","shortSummary":"","longSummary":"It’s hard dating someone who won’t give you the time of day. Su-ae Shim knows that better than anyone, having dated her indifferent boyfriend, Minu Kang, for years. She sometimes wishes she could be more like her charismatic stepsister, Ra-im, who seems to have it all. But life takes a turn for the weird when Su-ae discovers Jellypop, a sentient flip phone, in her locker. Jellypop has a lot to say about her love life, especially as Su-ae drifts further away from Minu and finds herself running into Minu’s friend, Eunhyeok. Add to the mix a growing suspicion that Minu and Ra-im might be more than friends, and Su-ae might need a miracle to navigate the ups and downs of high school romance! \n"},{"image":"https://webtoon-phinf.pstatic.net/20220526_195/16535178762752fc2R_PNG/4MaybeMeantToBe_thumbnail_desktop.png?type=a210","title":"Maybe Meant to BeMaybe Meant to Be","author":"honeyskein / damcho","likes":"9.1M","genre":"Romance","shortSummary":"","longSummary":"Jia Han, a 32-year-old freelancer with no work, is tired of her parents nagging her to get married and finally move out. When she runs into her childhood friend, Mincheol Jin, who is also feeling the same pressure from his parents, she blurts out that they should just get married to solve both of their problems. Little did she know he’d accept her suggestion, and she suddenly finds herself thrust into marriage. A story of an unexpected romance that’ll have you scrolling for more!"},{"image":"https://webtoon-phinf.pstatic.net/20230324_258/1679616766388zHB0g_JPEG/7SuitorArmor_thumbnail_desktop.jpg?type=a210","title":"Suitor ArmorSuitor Armor","author":"Purpah","likes":"10.8M","genre":"Fantasy","shortSummary":"","longSummary":"Lady-in-waiting, Lucia believes getting through the royal wedding will be the toughest part of her new life. That is until she finds herself falling head over heels with Modeus, an up-and-coming knight to the king's guard. With her newfound interest, she is quickly awakened to the mysteries of the kingdom when she learns Modeus is in fact an enchanted suit of armor without a soul. Could there be more to him than just shining armor? "},{"image":"https://webtoon-phinf.pstatic.net/20230218_89/1676651157435CR1x4_JPEG/1Villian_with_a_Crush_Launch_promobanner_desktop.jpg?type=q90","title":"Villain with a CrushVillain with a Crush","author":"seyoon","likes":"2.1M","genre":"Romance","shortSummary":"Dumped after confessing to her first crush of three years, Rosa Park falls for her second when the nation’s favorite Superpowered Police Officer, Doryeong Han, swoops in to save her as she’s plummeting from a toppling building. A few years later, a mysterious villain called Blackdog appears, but Doryeong notices something is not quite right. Will the world’s worst villain ever win the heart of the strongest hero in the country?","longSummary":"Dumped after confessing to her first crush of three years, Rosa Park falls for her second when the nation’s favorite Superpowered Police Officer, Doryeong Han, swoops in to save her as she’s plummeting from a toppling building. A few years later, a mysterious villain called Blackdog appears, but Doryeong notices something is not quite right. Will the world’s worst villain ever win the heart of the strongest hero in the country?"},{"image":"https://webtoon-phinf.pstatic.net/20170331_74/1490952135447r5fc5_JPEG/thumb_ipad.jpg?type=a210","title":"I Love YooI Love Yoo","author":"Quimchee","likes":"37.1M","genre":"Drama","shortSummary":"","longSummary":"Dogged by pain and misfortune from the very beginning, Shin-Ae decides she wants nothing to do with people nor anything to do with romance. Although content with her unsocial, boring, loveless existence, her lifestyle is challenged after she ruins an unsuspecting strangers' clothes."},{"image":"https://webtoon-phinf.pstatic.net/20220301_113/1646087478122mT2A5_JPEG/1Nevermore_thumbnail_desktop+28129.jpg?type=a210","title":"NevermoreNevermore","author":"Kate Flynn / Kit Trace","likes":"3.4M","genre":"Supernatural","shortSummary":"","longSummary":"There is nothing definitive about life after death, except the involuntary enrollment at the mysterious Nevermore Academy. Now Lenore and Annabel Lee must begin their curriculum to recover the memories of their tragic demise. Between the Dean's macabre demeanor and the tell-tale dangers of Final Exams, both girls must learn to rely on one another and their newly acquired ghost forms, or Spectres, to not only graduate from the academy… but to earn a second chance at life."},{"image":"https://webtoon-phinf.pstatic.net/20230616_35/1686869525599WCxVT_JPEG/1Thumbnail_Desktop.jpg?type=a210","title":"Be My VillainBe My Villain","author":"mintibi","likes":"4M","genre":"Romance","shortSummary":"","longSummary":"Mills is your average high school senior, despite having 2 super-agent dads who take down highly dangerous criminals. But during an attack on the city, his dads' arch nemesis, Shadowmaker, ends up saving his life! Being rescued by a supervillain is strange, but it only gets stranger when Shadowmaker asks him out on a date!"},{"image":"https://webtoon-phinf.pstatic.net/20220419_212/1650306597914dndg3_JPEG/2TheWorldAftertheFall_thumbnail_desktop.jpg?type=a210","title":"The World After the Fall The World After the Fall ","author":"singNsong / S-Cynan","likes":"3.1M","genre":"Action","shortSummary":"","longSummary":"Faced with imminent defeat and certain death, would you choose to run – or continue to fight for a doomed world? When mysterious towers appear across the world, summoning monsters that prey on mankind, this is the choice presented to the Tower Walkers – adventurers with special powers to fight the monsters. On the brink of death, they can choose to use a “regression stone” to return to the past for a second chance, though this decision places them in a separate timeline forever. Stubborn Tower Walker Jaehwan rejects this choice, choosing to fight for the original timeline, and learning shocking secrets about the Tower along the way."},{"image":"https://webtoon-phinf.pstatic.net/20230822_191/1692646965633v546L_JPEG/5JuvenileOffender_Thumbnail_Desktop.jpg?type=a210","title":"Juvenile OffenderJuvenile Offender","author":"Man's story / Jeongjongtaek","likes":"100,124","genre":"Action","shortSummary":"","longSummary":"Yunseong Lee is a victim of school bullying and decides to take revenge on school bullies by becoming a juvenile offender. After he enters a juvenile detention center, he meets a couple of guys who bullied him at school and executes his plan accordingly. However, there is one person who is yet to be avenged. Against these products of a failed judicial system, Yunseong's path of revenge begins. \nThis series contains strong themes and graphic depictions of violence, sexual harassment, and self-harm, suitable only for mature audiences. Viewer discretion is advised."},{"image":"https://webtoon-phinf.pstatic.net/20230413_87/1681342017862lL2z1_JPEG/2ITMTWU_thumbnail_desktop.jpg?type=a210","title":"I Thought My Time Was Up!I Thought My Time Was Up!","author":"Essie / Hyeyong","likes":"1.3M","genre":"Romance","shortSummary":"","longSummary":"Feeling a little under the weather, Lariette Blanche visits Doctor Zakascoff only to find out that she has an extremely rare congenital disease, and only three months left to live. Though devastated at first, Lariette decides to write up a bucket list of everything she wants to do before she dies. However, little did she know that the diagnosis was actually wrong! With so many changes implemented in her life already, what will Lariette do moving forward? Will she return to her previous life, or continue living the new one, full of adventures she had never imagined before?"},{"image":"https://webtoon-phinf.pstatic.net/20220903_86/1662153584580EEKVI_JPEG/3Daybreak_thumbnail_desktop.jpg?type=a210","title":"DaybreakDaybreak","author":"Moosopp","likes":"6.8M","genre":"Slice of life","shortSummary":"","longSummary":"Marcus has a crush, and Cog is completely unprepared for the hijinks that follow. Hopefully in their efforts to grow closer, they can brighten each other's day."},{"image":"https://webtoon-phinf.pstatic.net/20200606_156/1591401716322FNDzo_JPEG/10_EC8DB8EB84A4EC9DBC_ipad.jpg?type=a210","title":"The Kiss BetThe Kiss Bet","author":"Ingrid Ochoa","likes":"13.2M","genre":"Romance","shortSummary":"","longSummary":"It’s senior year and Sara Lin just turned 18. She’s got great friends, a cool Dad (or so he thinks) and a whole lot ahead of her. The last thing she needs is to worry about having her first kiss. But that’s all about to change because her good pal Patrick just challenged her to a bet that will either lead to love, heartbreak or embarrassment…or maybe all three."},{"image":"https://webtoon-phinf.pstatic.net/20230511_24/1683761097864qfRof_JPEG/9Thumbnail_PC.jpg?type=a210","title":"SwolematesSwolemates","author":"LummyPix","likes":"861,934","genre":"Comedy","shortSummary":"","longSummary":"When the cocky, social-media star Braydin, and the nerdy, gamer Alex first meet at the gym, their relationship starts off on the wrong foot. But, as they're forced to work together they find out they might have more in common than they initially thought. Also they get buff AF."},{"image":"https://webtoon-phinf.pstatic.net/20210727_144/1627340910766hCDKg_PNG/0DoomBreaker_desktop_thumbnail.png?type=a210","title":"Doom BreakerDoom Breaker","author":"Blue-Deep","likes":"4.3M","genre":"Action","shortSummary":"","longSummary":"Zephyr is the last human fighting evil in a world abandoned by the gods. When he is killed in battle by Tartarus, the god of destruction, all hope for humanity seems lost. But Zephyr’s fate is not sealed -- the gods who find his battles entertaining have gifted him a second chance at life, as he is sent ten years into the past, back to when he was a slave instead of the most powerful human alive. Can Zephyr get his revenge against Tartarus and save the woman he loves, or is he doomed to repeat the past?\n"},{"image":"https://webtoon-phinf.pstatic.net/20211111_77/1636569508631uv787_JPEG/7WishedYouWereDead_desktop_promobanner.jpg?type=q90","title":"Wished You Were DeadWished You Were Dead","author":"SEOCHEONG / ARAN","likes":"6.6M","genre":"Drama","shortSummary":"King Karloi of Croisen finds himself at odds with his position in life. His wife’s father, Duke Deluah, is angling for the throne, and as an outsider to the family, Karloi fears for his position. His frustrations have affected his marriage, though he finds himself questioning his cold approach to his wife, Evonne. He may no longer recognize her, but Evonne saved his life long ago, and was his first love. This is but one of many secrets Evonne bears the weight of, having fallen victim to a curse that prevents her from telling any secrets...\n","longSummary":"King Karloi of Croisen finds himself at odds with his position in life. His wife’s father, Duke Deluah, is angling for the throne, and as an outsider to the family, Karloi fears for his position. His frustrations have affected his marriage, though he finds himself questioning his cold approach to his wife, Evonne. He may no longer recognize her, but Evonne saved his life long ago, and was his first love. This is but one of many secrets Evonne bears the weight of, having fallen victim to a curse that prevents her from telling any secrets...\n"},{"image":"https://webtoon-phinf.pstatic.net/20201212_275/1607741681951KOJfw_JPEG/0LikeWindonaDryBranch_desktop_thumbnail.jpg?type=a210","title":"Like Wind on a Dry BranchLike Wind on a Dry Branch","author":"Dalsaeowl / Hwaeum","likes":"10.9M","genre":"Fantasy","shortSummary":"","longSummary":"As plague and turmoil afflicts the empire, enchanting widow Rieta Tristi finds herself at the mercy of a malicious nobleman and his dying wish to have her buried alive beside his corpse. The plague has taken her husband, slave traders have taken her young child, and now her own life is at risk -- until an unexpected visit from the empire's outcast prince changes everything."},{"image":"https://webtoon-phinf.pstatic.net/20211202_60/1638410211995M4UJi_JPEG/4DeathRescheduled_desktop_thumbnail.jpg?type=a210","title":"Death: RescheduledDeath: Rescheduled","author":"Snailords","likes":"3.8M","genre":"Thriller","shortSummary":"","longSummary":"Yes, you get one kill a year. But you can also get murdered for any reason, at all! In one district, sex and romance are also illegal. Kissed someone? Dead. Made coffee with the wrong amount of sugar? Extra dead.\nI’m done. We’re fixing this. "},{"image":"https://webtoon-phinf.pstatic.net/20200513_90/1589332188875qrVlg_JPEG/10_EC8DB8EB84A4EC9DBC_ipad.jpg?type=a210","title":"Your ThroneYour Throne","author":"SAM","likes":"15.7M","genre":"Fantasy","shortSummary":"","longSummary":"Tensions are brewing under the seemingly calm surface of the Vasilios Empire, a kingdom ruled by the Imperial Family and the Temple. Lady Medea Solon has lost her place next to Crown Prince Eros, but resolves to do whatever it will take to win back what's rightfully hers. Will she reclaim her throne?"},{"image":"https://webtoon-phinf.pstatic.net/20230520_3/1684548381163AR02n_JPEG/0RemarriedEmpress_promobanner_desktop.jpg?type=q90","title":"The Remarried EmpressThe Remarried Empress","author":"Alphatart / Sumpul","likes":"30.3M","genre":"Fantasy","shortSummary":"Navier Ellie Trovi was an empress perfect in every way -- intelligent, courageous, and socially adept. She was kind to her subjects and devoted to her husband. Navier was perfectly content to live the rest of her days as the wise empress of the Eastern Empire. That is, until her husband brought home a mistress and demanded a divorce. “I accept this divorce… And I request an approval of my remarriage.” In a shocking twist, Navier remarries another emperor and retains her title and childhood dream as empress. But just how did everything unfold?\n","longSummary":"Navier Ellie Trovi was an empress perfect in every way -- intelligent, courageous, and socially adept. She was kind to her subjects and devoted to her husband. Navier was perfectly content to live the rest of her days as the wise empress of the Eastern Empire. That is, until her husband brought home a mistress and demanded a divorce. “I accept this divorce… And I request an approval of my remarriage.” In a shocking twist, Navier remarries another emperor and retains her title and childhood dream as empress. But just how did everything unfold?\n"},{"image":"https://webtoon-phinf.pstatic.net/20230822_241/1692647093714Hrzak_JPEG/7MadeofStardust_thumbnail_desktop.jpg?type=a210","title":"Made of StardustMade of Stardust","author":"Kalisami","likes":"383,102","genre":"Fantasy","shortSummary":"","longSummary":"Kalisa is a young star who has fallen from the heavens and finds herself in an entirely new world where she is held captive by a young king. All alone and with no memory of her past, Kalisa escapes from the kingdom to find a way back home. With the help of new friends that she meets along the way, Kalisa embarks on a journey to break the curse she's under and return home to the stars. However, will she be able to do all this before the king finds her?"},{"image":"https://webtoon-phinf.pstatic.net/20210504_152/16200853872927nrBD_JPEG/1GetSchooled_desktop_thumbnail.jpg?type=a210","title":"Get SchooledGet Schooled","author":"Yongtaek Chae / GARAM HAN","likes":"9.1M","genre":"Drama","shortSummary":"","longSummary":"Hwajin Na’s teaching techniques are pretty violent for someone who works in the Ministry of Education. That being said, when punishments don't seem to work on even the worst of school bullies, there is no better man for the job. Sometimes you can’t get a good education until those bullies are taught a lesson."},{"image":"https://webtoon-phinf.pstatic.net/20211116_239/1637004214959piwJa_JPEG/4The+Greatest+Estate+Developer_Launch_desktop_thumbnail.jpg?type=a210","title":"The Greatest Estate DeveloperThe Greatest Estate Developer","author":"Lee hyunmin / Kim Hyunsoo","likes":"4.7M","genre":"Fantasy","shortSummary":"","longSummary":"When civil engineering student Suho Kim falls asleep reading a fantasy novel, he wakes up as a character in the book! Suho is now in the body of Lloyd Frontera, a lazy noble who loves to drink, and whose family is in a mountain of debt. Using his engineering knowledge, Suho designs inventions to avert the terrible future that lies in wait for him. With the help of a giant hamster, a knight, and the world’s magic, can Suho dig his new family out of debt and build a better future?"},{"image":"https://webtoon-phinf.pstatic.net/20210818_71/1629228960443svu5k_JPEG/4FromKnighttoLady_desktop_thumbnail.jpg?type=a210","title":"From a Knight to a LadyFrom a Knight to a Lady","author":"Ink. / Hyerim Sung","likes":"5.3M","genre":"Fantasy","shortSummary":"","longSummary":"Estelle meets her untimely death as a valiant knight of the Kingdom of Ersha. But death is not the end for Estelle -- three years after her demise, she finds herself reincarnated in the body of Lucifela Aydin, the spoiled and cold-hearted daughter of a count in the Empire of Jansgar. To her dismay, she finds that her country fell to Jansgar years ago, and that she is now betrothed to Zedekiah Heint, the son of a duke and her adversary in her previous life. Can Estelle discover the truth behind her death while attempting to navigate her new life as Lucifela?"},{"image":"https://webtoon-phinf.pstatic.net/20211012_36/1633978251222Fa3sz_JPEG/9PerfectMarriageRevenge_desktop_thumbnail.jpg?type=a210","title":"Perfect Marriage RevengePerfect Marriage Revenge","author":"Yibambe / so young","likes":"5.6M","genre":"Romance","shortSummary":"","longSummary":"Iju Han isn’t sure where her life went wrong. Once the heiress to a wealthy business magnate, she’s now an ordinary housewife whose main concerns are her nagging in-laws and household chores. Things take a much more tragic turn, however, when she finds her husband confessing his love to her stepsister. Devastated, she runs away, only to be hit by a car and killed. But when she opens her eyes, she finds that she’s awakened a year ago in the past, before her life went awry. Given a second chance at life, Iju vows revenge, determined to take back all that she’s lost."},{"image":"https://webtoon-phinf.pstatic.net/20230420_11/1681984020170buAUU_JPEG/0BA_thumbnail_desktop.jpg?type=a210","title":"Boundless AscensionBoundless Ascension","author":"2love (REDICE STUDIO) / SHYATAN (REDICE STUDIO)","likes":"461,528","genre":"Action","shortSummary":"","longSummary":"Seong-yun Han was just a boy when his parents were killed by monsters unleashed during a mysterious calamity called the “Dungeon Break.” Seven years later, Seong-yun is devastated to find that his grinding efforts to become a Hunter, fierce warriors who seek out and destroy monsters, are entirely in vain, as his fighting attributes have not increased at all. Seong-yun’s world flips on a dime when he accepts an invitation to join the Tower of Trials, an otherworldly realm where challengers must overcome trials that pit them against monsters and humans alike.\n\n"},{"image":"https://webtoon-phinf.pstatic.net/20211209_190/1639018225763iM75N_JPEG/8The+Lone+Necromancer_Launch_desktop_thumbnail.jpg?type=a210","title":"The Lone NecromancerThe Lone Necromancer","author":"JJJ / KIM KYOUNG-YEOL","likes":"3.3M","genre":"Fantasy","shortSummary":"","longSummary":"Seongwu is a former special forces soldier who has returned to college after completing his national service. His ordinary life as a student is shattered during class one day when he and his fellow students are faced with a mysterious prompt asking them to “select a role.” Seongwu chooses the necromancer, a rare ability that grants him the power to control the undead. With the campus and outside world seemingly on the brink of collapse, Seongwu must use his newfound powers to battle fearsome monsters and help save his fellow students. But will they make it out alive?\n"},{"image":"https://webtoon-phinf.pstatic.net/20211002_17/1633129378346C9M64_JPEG/6The+Druid+of+Seoul+Station_Launch_desktop_thumbnail.jpg?type=a210","title":"The Druid of Seoul StationThe Druid of Seoul Station","author":"liveBear / Mun sung ho","likes":"3.3M","genre":"Action","shortSummary":"","longSummary":"What started out as an ordinary day turned upside down when an unknown catastrophe struck Earth, transporting Suho Park to a different planet. He eventually learns how to adapt and fight for his survival in this foreign world, but one day, just as suddenly as he was sucked into this new planet, Suho is pulled back to Earth. He quickly learns that return to life as he remembers it is no longer possible, as Earth is in constant battle with monsters who’ve managed to infiltrate the planet. How will Suho fight against the monsters attacking Earth, and will he be able to survive this time with his current skills?"},{"image":"https://webtoon-phinf.pstatic.net/20230819_140/169240034900888OvV_JPEG/1HowAGoddessWinsOverTigers_thumbnail_desktop.jpg?type=a210","title":"How a Goddess Wins Over TigersHow a Goddess Wins Over Tigers","author":"Awan / Chungla","likes":"39,390","genre":"Romance","shortSummary":"","longSummary":"After being betrayed by her lover, the sun god Moha meets a bitter death--but soon finds herself thrust back into her past in someone else's body. Two tiger spirits from Moha's past vie for her affection as she struggles against the looming tragedy that once ripped her heart--and the world--apart.\nAs Moha navigates this unfamiliar world alone with no divine power, will she be able to change the tragic course of her life and find true love? \n"},{"image":"https://webtoon-phinf.pstatic.net/20230822_143/1692669326233n0lF6_JPEG/9MyMiniatureLifeManual_Thumbnail_Desktop.jpg?type=a210","title":"My Miniature Life ManualMy Miniature Life Manual","author":"Ellen Shim","likes":"52,940","genre":"Comedy","shortSummary":"","longSummary":"Eunseo and Myeongjin are two childhood friends who grew apart as they got older, but things take an unexpected turn when Eunseo gets a packet of jelly beans from a mysterious old lady. The next morning, Eunseo becomes the size of a little bean himself! However, the only person Eunseo can ask for help is Myeongjin. Life is suddenly so different for Eunseo; Will they be able to find out why he shrunk, and bring Eunseo back to his normal size? And what will this do to their friendship?  "},{"image":"https://webtoon-phinf.pstatic.net/20230830_173/1693330547839tP0BY_JPEG/3Swordid_Landing-Page_Thumbnail_Desktop.jpg?type=a210","title":"SwordidSwordid","author":"Momojiji","likes":"53,311","genre":"Fantasy","shortSummary":"","longSummary":"Reincarnating into the wrong body never stopped a revenge quest! Now a gutsy peasant instead of a wizard, Cato’s still got to settle the score with the great demon Baal. Luckily, their sassy talking greatsword has a plan. If only Cato would follow directions. "},{"image":"https://webtoon-phinf.pstatic.net/20230822_271/1692669680348tUurj_JPEG/9MaruIsAPuppy_promobanner_desktop.jpg?type=q90","title":"Maru is a PuppyMaru is a Puppy","author":"Mojo","likes":"44,883","genre":"Comedy","shortSummary":"Woori’s 5-year old poodle mix, Maru, has turned into a human —  a 5-year old little girl, that is! Now Woori’s gone from pet owner to big sister, and it’s her job to keep Maru out of trouble. Human Maru has the same endless curiosity and playfulness of a puppy, but now she can walk into grocery stores, go to kindergarten, and check this out — hold things with her opposable thumbs. Being human rules!","longSummary":"Woori’s 5-year old poodle mix, Maru, has turned into a human —  a 5-year old little girl, that is! Now Woori’s gone from pet owner to big sister, and it’s her job to keep Maru out of trouble. Human Maru has the same endless curiosity and playfulness of a puppy, but now she can walk into grocery stores, go to kindergarten, and check this out — hold things with her opposable thumbs. Being human rules!"},{"image":"https://webtoon-phinf.pstatic.net/20230908_78/1694114068105OIHCI_JPEG/8One-Coin-Clear_thumbnail_desktop.jpg?type=a210","title":"One Coin ClearOne Coin Clear","author":"Akheres / studio hohoee","likes":"25,804","genre":"Action","shortSummary":"","longSummary":"“Die in the game, and die in real life.” Taeyang must use his godlike gaming abilities to traverse the stages of roguelike virtual reality game “Dantalian” to find his trapped sister. The only catch is, in Dantalian, your life is synced to your character. If you die in the game, you die in real life."},{"image":"https://webtoon-phinf.pstatic.net/20230822_191/1692646965633v546L_JPEG/5JuvenileOffender_Thumbnail_Desktop.jpg?type=a210","title":"Juvenile OffenderJuvenile Offender","author":"Man's story / Jeongjongtaek","likes":"100,124","genre":"Action","shortSummary":"","longSummary":"Yunseong Lee is a victim of school bullying and decides to take revenge on school bullies by becoming a juvenile offender. After he enters a juvenile detention center, he meets a couple of guys who bullied him at school and executes his plan accordingly. However, there is one person who is yet to be avenged. Against these products of a failed judicial system, Yunseong's path of revenge begins. \nThis series contains strong themes and graphic depictions of violence, sexual harassment, and self-harm, suitable only for mature audiences. Viewer discretion is advised."},{"image":"https://webtoon-phinf.pstatic.net/20230823_74/1692734636266eCjet_JPEG/1UnstoppableHayeong_thumbnail_desktop.jpg?type=a210","title":"Unstoppable HayeongUnstoppable Hayeong","author":"woo_eong","likes":"117,097","genre":"Drama","shortSummary":"","longSummary":"Yeonji, a high school girl who tries to help her classmate from abuse, ends up making herself the target of a bully. Her struggles only seem to get worse until the new girl Hayeong steps in for support, declaring war on the bullies. But the more Hayeong fights against mistreatment, the more hostility she attracts, and she must fight her way to keep the ones she cares for safe."},{"image":"https://webtoon-phinf.pstatic.net/20230831_261/1693431143478mu69F_JPEG/4FistWielder_promobanner_desktop.jpg?type=q90","title":"Fist WielderFist Wielder","author":"Studio Ace Productions","likes":"21,100","genre":"Action","shortSummary":"What's a teenager to do when transported from the suburbs into a monster-ridden world? Join the monster slayers, of course. Leinna's never stopped looking for her mom since she disappeared 10 years ago. So when she finds signs of her in the land of Roxaria, she's got to follow the trail, even if it means joining a war in the process. Armed with just her fists, Leinna's got a lot of leveling up to do!  ","longSummary":"What's a teenager to do when transported from the suburbs into a monster-ridden world? Join the monster slayers, of course. Leinna's never stopped looking for her mom since she disappeared 10 years ago. So when she finds signs of her in the land of Roxaria, she's got to follow the trail, even if it means joining a war in the process. Armed with just her fists, Leinna's got a lot of leveling up to do!  "}]